# Parameter Type Id Rebar Shape Crank Start Offset Property

Source: https://www.revitapidocs.com/2026/93e9d695-bc64-5d00-dd26-5cb1d7f20f13.htm

---

| Parameter Type Id Rebar Shape Crank Start Offset Property |
| --- |

"Start Crank Offset"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeCrankStartOffset { get; }
```

```
Public Shared ReadOnly Property RebarShapeCrankStartOffset As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeCrankStartOffset {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeCrankStartOffset : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace